In [35]:
import numpy as np
import pandas as pd

In [36]:
df= pd.read_csv("HR RAW DATA.csv", index_col=0)
pd.set_option('display.max_columns', None)

In [37]:
df.head(2)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1

In [38]:
df.sample(5)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
1370,41,No,NaN,"167,0$",NaN,12,4,NaN,1,"1158,0",2,0,46,3,1,lABOraToRy TEChNIciaN,4,NaN,"4766,0",9051,3,NaN,Yes,11,"3,0",1,"80,0",1,"6,0",4,NaN,1,NaN,0,0,"4766,0",1982,1000000000$,NaN,NaN,0
54,56,No,non-travel,"667,0$",NaN,1,4,Life Sciences,1,"2026,0",3,0,57,3,2,hEALThcArE REPrESeNTATive,3,Divorced,NaN,26236,1,Y,No,21,NaN,1,NaN,1,NaN,2,"2,0",13,NaN,1,9,NaN,1967,1000000000$,NaN,NaN,Yes
1279,18,No,NaN,"812,0$",NaN,10,3,NaN,1,NaN,4,1,69,2,1,sALes rEPrESenTativE,3,NaN,"1200,0",9724,1,Y,No,12,"3,0",1,NaN,0,"0,0",2,"3,0",0,NaN,0,0,"1200,0",2005,1000000000$,NaN,NaN,0
562,35,No,travel_rarely,"1214,0$",NaN,1,3,Medical,1,NaN,2,0,30,2,1,RESeaRCh sCientIsT,3,Single,NaN,26278,1,NaN,No,18,"3,0",1,NaN,0,"6,0",3,"3,0",6,NaN,0,4,NaN,1988,1000000000$,NaN,NaN,False
1393,31,Yes,travel_frequently,nan$,NaN,1,4,Life Sciences,1,"1427,0",2,1,50,1,1,sALeS RePReSENtAtiVe,3,Single,NaN,16154,1,NaN,NaN,12,NaN,2,NaN,0,NaN,3,"3,0",1,NaN,0,0,NaN,1992,1000000000$,NaN,NaN,0

In [39]:
df.dtypes

Age                          object
Attrition                    object
BusinessTravel               object
DailyRate                    object
Department                   object
DistanceFromHome              int64
Education                     int64
EducationField               object
employeecount                 int64
employeenumber               object
EnvironmentSatisfaction       int64
Gender                        int64
HourlyRate                   object
JobInvolvement                int64
JobLevel                      int64
JobRole                      object
JobSatisfaction               int64
MaritalStatus                object
MonthlyIncome                object
MonthlyRate                   int64
NUMCOMPANIESWORKED            int64
Over18                       object
OverTime                     object
PercentSalaryHike             int64
PerformanceRating            object
RelationshipSatisfaction      int64
StandardHours                object
StockOptionLevel              int64
TOTALWORKINGYEARS            object
TrainingTimesLastYear         int64
WORKLIFEBALANCE              object
YearsAtCompany                int64
YearsInCurrentRole           object
YearsSinceLastPromotion       int64
YEARSWITHCURRMANAGER          int64
SameAsMonthlyIncome          object
DateBirth                     int64
Salary                       object
RoleDepartament              object
NUMBERCHILDREN              float64
RemoteWork                   object
dtype: object

In [44]:
df.Salary[1200:1500]

1200    1000000000$
1201    1000000000$
1202    1000000000$
1203    1000000000$
1204    1000000000$
           ...
1495    1000000000$
1496    1000000000$
1497    1000000000$
1498    1000000000$
1499    1000000000$
Name: Salary, Length: 300, dtype: object

## ERRORES

Nombres de columnas inconsistentes.
 RoleDepartment - problemas mayus/minus
 BusinessTravel, dif guiones en registros (travel_rarely / non-travel) 


employeecount de qué sirve?
employeenumber porqué es float?
Diferencia entre employeenumber y employeeID (en employeenumber muchos son Nan) borrar employeenumber?
Salary está mal o por qué son todos 1000000000$	?
daily rate 914 = nan$	?
JobRole muchas inconsistencias de mayus y minus
MonthlyIncome	MonthlyRate -en qué se diferencian? distintos values
HourlyRate 1108 - Notavailable cambiar por Nan

¿Columnas duplicadas?
salary/ monthly income/ dailyrate/ sameasmonthlyincome
roledepartment /jobrole/department
enviromentsatisfaction/jobsatisfaction

# DistanceFromHome, valores negativos
# Muchas columnas que son de tipo objetos
# RemoteWork unificar Yes/True y 1/0 pasar a booleanos
# columna unnamed a employeeID
# over18 son todas Nan y Yes?

Attrition a booleanos T/F
daily rate pasar a float